labels = {'generate_prompt': 'Створити підказку', 'save_txt': 'Зберегти як .txt', 'translated_prompt': 'Готова підказка (EN):', 'weight_plus': 'Вага +', 'weight_minus': 'Вага -', 'adjust_weight': 'Налаштувати вагу вибраного тексту:', 'help': 'Довідка', 'main_subject': 'Головний об’єкт (Хто або що на зображенні)', 'style_genre': 'Стиль або жанр (кіберпанк, бароко, концепт-арт)', 'medium_technique': 'Матеріал та техніка (олія на полотні, ескіз олівцем, 3D-візуалізація, фото)', 'realism_quality': 'Рівень реалізму чи якості (висока деталізація, ультрареалістичний, 4K, чіткий фокус)', 'composition': 'Композиція та кадрування (портрет, ізометричний вигляд, вид згори)', 'background': 'Фон та середовище (сніжний ліс, під водою, білий фон)', 'lighting_mood': 'Освітлення та настрій (м’яке освітлення, кінематографічне освітлення, сяйво заходу сонця, неонове світло)', 'colors_palette': 'Кольори / палітра / акценти / домінантні деталі'}
help_text = """📘 Prompter 2 – Керівництво користувача
Створено Damizon • 2025

🎯 Що таке Prompter2
Prompter — це інструмент для створення високоякісних prompt-ів для Stable Diffusion англійською мовою.
Програма автоматично перекладає введені фрази англійською з понад 70 мов.
Після заповнення необхідних полів програма формує prompt у правильному порядку та перекладає його.
Не обов’язково заповнювати всі поля — використовуйте лише ті, що потрібні вам у цей момент.

📝 Як користуватися програмою:

Заповніть текстові поля описами:

Головна тема, стиль, техніка, освітлення, фон тощо.
Використовуйте коми для розділення кожного елемента prompt-а. Це допомагає ШІ розглядати їх як окремі характеристики чи інструкції.
Уникайте крапок (.) — вони не потрібні.
Лапки не мають особливого значення.

Вага слова визначає його важливість у prompt-е.
Чим вища вага, тим більше ШІ зосередиться на цьому слові.
Щоб застосувати вагу:

Виділіть текст і скористайтеся кнопками [+] або [–], щоб змінити вагу слова.

Приклад: (cyberpunk:1.6) підвищує значущість “cyberpunk”.

Приклад: (cyberpunk:0.6) зменшує значущість “cyberpunk”.
🔻 1.0 = нормально
🔺 2.0 = дуже важливо
🔻 0.5 = менш важливо

Натисніть «Generate Prompt»:

Поля зберуться в один prompt.

Текст автоматично перекладеться англійською.

Перекладений prompt буде скопійовано до буфера обміну.

Необов’язково: збережіть prompt у файлі TXT.

💡 Поради:
• Поєднуйте короткі та довгі фрази (наприклад, “портрет”, “бароковий стиль”).
• Використовуйте колір і світло, щоб створити атмосферу (наприклад, “неон”, “захід сонця”).
• Експериментуйте та переглядайте результати!

🔗 Допомога та розвиток проекту:
github.com/Damizon/Prompter
"""
about = "Prompter 2 • Damizon 2025"



